IDENTIFICATION DIVISION.
PROGRAM-ID. DEMO_NEW_MODULE_NO_MASTER.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-DUMMY PIC X.

PROCEDURE DIVISION.
A-MAIN SECTION.
A-MAIN-000.
    PERFORM B-INIT-000
    PERFORM Z-FINISH-000
    GOBACK.

B-INIT SECTION.
B-INIT-000.
    EXIT.

Z-FINISH SECTION.
Z-FINISH-000.
    EXIT.
